Microchip-MPLAB-Harmony/csp_apps_pic32cm_jh00_jh01/apps/port/port_led_on_off_polling/firmware/src/packs/PIC32CM5164JH00100_DFP/component/dmac.h
#define DMAC_BASEADDR_BASEADDR_Pos            _U_(0)                                               /**< (DMAC_BASEADDR) Descriptor Memory Base Address Position */
#define DMAC_BASEADDR_BASEADDR_Msk            (_U_(0xFFFFFFFF) << DMAC_BASEADDR_BASEADDR_Pos)      /**< (DMAC_BASEADDR) Descriptor Memory Base Address Mask */
#define DMAC_BASEADDR_BASEADDR(value)         (DMAC_BASEADDR_BASEADDR_Msk & ((value) << DMAC_BASEADDR_BASEADDR_Pos))
#define DMAC_BASEADDR_Msk                     _U_(0xFFFFFFFF)                                      /**< (DMAC_BASEADDR) Register Mask  */


/* -------- DMAC_WRBADDR : (DMAC Offset: 0x38) (R/W 32) Write-Back Memory Section Base Address -------- */
#define DMAC_WRBADDR_RESETVALUE               _U_(0x00)                                            /**<  (DMAC_WRBADDR) Write-Back Memory Section Base Address  Reset Value */

#define DMAC_WRBADDR_WRBADDR_Pos              _U_(0)                                               /**< (DMAC_WRBADDR) Write-Back Memory Base Address Position */
#define DMAC_WRBADDR_WRBADDR_Msk              (_U_(0xFFFFFFFF) << DMAC_WRBADDR_WRBADDR_Pos)        /**< (DMAC_WRBADDR) Write-Back Memory Base Address Mask */
#define DMAC_WRBADDR_WRBADDR(value)           (DMAC_WRBADDR_WRBADDR_Msk & ((value) << DMAC_WRBADDR_WRBADDR_Pos))
#define DMAC_WRBADDR_Msk                      _U_(0xFFFFFFFF)                                      /**< (DMAC_WRBADDR) Register Mask  */


/* -------- DMAC_CHID : (DMAC Offset: 0x3F) (R/W 8) Channel ID -------- */
#define DMAC_CHID_RESETVALUE                  _U_(0x00)                                            /**<  (DMAC_CHID) Channel ID  Reset Value */

#define DMAC_CHID_ID_Pos                      _U_(0)                                               /**< (DMAC_CHID) Channel ID Position */
#define DMAC_CHID_ID_Msk                      (_U_(0xF) << DMAC_CHID_ID_Pos)                       /**< (DMAC_CHID) Channel ID Mask */
#define DMAC_CHID_ID(value)                   (DMAC_CHID_ID_Msk & ((value) << DMAC_CHID_ID_Pos))  
#define DMAC_CHID_Msk                         _U_(0x0F)                                            /**< (DMAC_CHID) Register Mask  */


/* -------- DMAC_CHCTRLA : (DMAC Offset: 0x40) (R/W 8) Channel Control A -------- */
#define DMAC_CHCTRLA_RESETVALUE               _U_(0x00)                                            /**<  (DMAC_CHCTRLA) Channel Control A  Reset Value */

#define DMAC_CHCTRLA_SWRST_Pos                _U_(0)                                               /**< (DMAC_CHCTRLA) Channel Software Reset Position */
#define DMAC_CHCTRLA_SWRST_Msk                (_U_(0x1) << DMAC_CHCTRLA_SWRST_Pos)                 /**< (DMAC_CHCTRLA) Channel Software Reset Mask */
#define DMAC_CHCTRLA_SWRST(value)             (DMAC_CHCTRLA_SWRST_Msk & ((value) << DMAC_CHCTRLA_SWRST_Pos))
#define DMAC_CHCTRLA_ENABLE_Pos               _U_(1)                                               /**< (DMAC_CHCTRLA) Channel Enable Position */
#define DMAC_CHCTRLA_ENABLE_Msk               (_U_(0x1) << DMAC_CHCTRLA_ENABLE_Pos)                /**< (DMAC_CHCTRLA) Channel Enable Mask */
#define DMAC_CHCTRLA_ENABLE(value)            (DMAC_CHCTRLA_ENABLE_Msk & ((value) << DMAC_CHCTRLA_ENABLE_Pos))
#define DMAC_CHCTRLA_RUNSTDBY_Pos             _U_(6)                                               /**< (DMAC_CHCTRLA) Channel run in standby Position */
#define DMAC_CHCTRLA_RUNSTDBY_Msk             (_U_(0x1) << DMAC_CHCTRLA_RUNSTDBY_Pos)              /**< (DMAC_CHCTRLA) Channel run in standby Mask */
#define DMAC_CHCTRLA_RUNSTDBY(value)          (DMAC_CHCTRLA_RUNSTDBY_Msk & ((value) << DMAC_CHCTRLA_RUNSTDBY_Pos))
#define DMAC_CHCTRLA_Msk                      _U_(0x43)                                            /**< (DMAC_CHCTRLA) Register Mask  */


/* -------- DMAC_CHCTRLB : (DMAC Offset: 0x44) (R/W 32) Channel Control B -------- */
#define DMAC_CHCTRLB_RESETVALUE               _U_(0x00)                                            /**<  (DMAC_CHCTRLB) Channel Control B  Reset Value */

#define DMAC_CHCTRLB_EVACT_Pos                _U_(0)                                               /**< (DMAC_CHCTRLB) Event Input Action Position */
#define DMAC_CHCTRLB_EVACT_Msk                (_U_(0x7) << DMAC_CHCTRLB_EVACT_Pos)                 /**< (DMAC_CHCTRLB) Event Input Action Mask */
#define DMAC_CHCTRLB_EVACT(value)             (DMAC_CHCTRLB_EVACT_Msk & ((value) << DMAC_CHCTRLB_EVACT_Pos))
#define   DMAC_CHCTRLB_EVACT_NOACT_Val        _U_(0x0)                                             /**< (DMAC_CHCTRLB) No action  */
#define   DMAC_CHCTRLB_EVACT_TRIG_Val         _U_(0x1)                                             /**< (DMAC_CHCTRLB) Transfer and periodic transfer trigger  */
#define   DMAC_CHCTRLB_EVACT_CTRIG_Val        _U_(0x2)                                             /**< (DMAC_CHCTRLB) Conditional transfer trigger  */
#define   DMAC_CHCTRLB_EVACT_CBLOCK_Val       _U_(0x3)                                             /**< (DMAC_CHCTRLB) Conditional block transfer  */
#define   DMAC_CHCTRLB_EVACT_SUSPEND_Val      _U_(0x4)                                             /**< (DMAC_CHCTRLB) Channel suspend operation  */
#define   DMAC_CHCTRLB_EVACT_RESUME_Val       _U_(0x5)                                             /**< (DMAC_CHCTRLB) Channel resume operation  */
#define   DMAC_CHCTRLB_EVACT_SSKIP_Val        _U_(0x6)                                             /**< (DMAC_CHCTRLB) Skip next block suspend action  */
#define DMAC_CHCTRLB_EVACT_NOACT              (DMAC_CHCTRLB_EVACT_NOACT_Val << DMAC_CHCTRLB_EVACT_Pos) /**< (DMAC_CHCTRLB) No action Position  */
#define DMAC_CHCTRLB_EVACT_TRIG               (DMAC_CHCTRLB_EVACT_TRIG_Val << DMAC_CHCTRLB_EVACT_Pos) /**< (DMAC_CHCTRLB) Transfer and periodic transfer trigger Position  */
#define DMAC_CHCTRLB_EVACT_CTRIG              (DMAC_CHCTRLB_EVACT_CTRIG_Val << DMAC_CHCTRLB_EVACT_Pos) /**< (DMAC_CHCTRLB) Conditional transfer trigger Position  */
#define DMAC_CHCTRLB_EVACT_CBLOCK             (DMAC_CHCTRLB_EVACT_CBLOCK_Val << DMAC_CHCTRLB_EVACT_Pos) /**< (DMAC_CHCTRLB) Conditional block transfer Position  */
#define DMAC_CHCTRLB_EVACT_SUSPEND            (DMAC_CHCTRLB_EVACT_SUSPEND_Val << DMAC_CHCTRLB_EVACT_Pos) /**< (DMAC_CHCTRLB) Channel suspend operation Position  */
#define DMAC_CHCTRLB_EVACT_RESUME             (DMAC_CHCTRLB_EVACT_RESUME_Val << DMAC_CHCTRLB_EVACT_Pos) /**< (DMAC_CHCTRLB) Channel resume operation Position  */
#define DMAC_CHCTRLB_EVACT_SSKIP              (DMAC_CHCTRLB_EVACT_SSKIP_Val << DMAC_CHCTRLB_EVACT_Pos) /**< (DMAC_CHCTRLB) Skip next block suspend action Position  */
#define DMAC_CHCTRLB_EVIE_Pos                 _U_(3)                                               /**< (DMAC_CHCTRLB) Channel Event Input Enable Position */
#define DMAC_CHCTRLB_EVIE_Msk                 (_U_(0x1) << DMAC_CHCTRLB_EVIE_Pos)                  /**< (DMAC_CHCTRLB) Channel Event Input Enable Mask */
#define DMAC_CHCTRLB_EVIE(value)              (DMAC_CHCTRLB_EVIE_Msk & ((value) << DMAC_CHCTRLB_EVIE_Pos))
#define DMAC_CHCTRLB_EVOE_Pos                 _U_(4)                                               /**< (DMAC_CHCTRLB) Channel Event Output Enable Position */
#define DMAC_CHCTRLB_EVOE_Msk                 (_U_(0x1) << DMAC_CHCTRLB_EVOE_Pos)                  /**< (DMAC_CHCTRLB) Channel Event Output Enable Mask */
#define DMAC_CHCTRLB_EVOE(value)              (DMAC_CHCTRLB_EVOE_Msk & ((value) << DMAC_CHCTRLB_EVOE_Pos))
#define DMAC_CHCTRLB_LVL_Pos                  _U_(5)                                               /**< (DMAC_CHCTRLB) Channel Arbitration Level Position */
#define DMAC_CHCTRLB_LVL_Msk                  (_U_(0x3) << DMAC_CHCTRLB_LVL_Pos)                   /**< (DMAC_CHCTRLB) Channel Arbitration Level Mask */
#define DMAC_CHCTRLB_LVL(value)               (DMAC_CHCTRLB_LVL_Msk & ((value) << DMAC_CHCTRLB_LVL_Pos))
#define   DMAC_CHCTRLB_LVL_LVL0_Val           _U_(0x0)                                             /**< (DMAC_CHCTRLB) Channel Priority Level 0  */
#define   DMAC_CHCTRLB_LVL_LVL1_Val           _U_(0x1)                                             /**< (DMAC_CHCTRLB) Channel Priority Level 1  */
#define   DMAC_CHCTRLB_LVL_LVL2_Val           _U_(0x2)                                             /**< (DMAC_CHCTRLB) Channel Priority Level 2  */
#define   DMAC_CHCTRLB_LVL_LVL3_Val           _U_(0x3)                                             /**< (DMAC_CHCTRLB) Channel Priority Level 3  */
#define DMAC_CHCTRLB_LVL_LVL0                 (DMAC_CHCTRLB_LVL_LVL0_Val << DMAC_CHCTRLB_LVL_Pos)  /**< (DMAC_CHCTRLB) Channel Priority Level 0 Position  */
#define DMAC_CHCTRLB_LVL_LVL1                 (DMAC_CHCTRLB_LVL_LVL1_Val << DMAC_CHCTRLB_LVL_Pos)  /**< (DMAC_CHCTRLB) Channel Priority Level 1 Position  */
#define DMAC_CHCTRLB_LVL_LVL2                 (DMAC_CHCTRLB_LVL_LVL2_Val << DMAC_CHCTRLB_LVL_Pos)  /**< (DMAC_CHCTRLB) Channel Priority Level 2 Position  */
#define DMAC_CHCTRLB_LVL_LVL3                 (DMAC_CHCTRLB_LVL_LVL3_Val << DMAC_CHCTRLB_LVL_Pos)  /**< (DMAC_CHCTRLB) Channel Priority Level 3 Position  */
#define DMAC_CHCTRLB_TRIGSRC_Pos              _U_(8)                                               /**< (DMAC_CHCTRLB) Trigger Source Position */
#define DMAC_CHCTRLB_TRIGSRC_Msk              (_U_(0x3F) << DMAC_CHCTRLB_TRIGSRC_Pos)              /**< (DMAC_CHCTRLB) Trigger Source Mask */
#define DMAC_CHCTRLB_TRIGSRC(value)           (DMAC_CHCTRLB_TRIGSRC_Msk & ((value) << DMAC_CHCTRLB_TRIGSRC_Pos))
#define   DMAC_CHCTRLB_TRIGSRC_DISABLE_Val    _U_(0x0)                                             /**< (DMAC_CHCTRLB) Only software/event triggers  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM0_RX_Val _U_(0x2)                                             /**< (DMAC_CHCTRLB) SERCOM0 RX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM0_TX_Val _U_(0x3)                                             /**< (DMAC_CHCTRLB) SERCOM0 TX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM1_RX_Val _U_(0x4)                                             /**< (DMAC_CHCTRLB) SERCOM1 RX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM1_TX_Val _U_(0x5)                                             /**< (DMAC_CHCTRLB) SERCOM1 TX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM2_RX_Val _U_(0x6)                                             /**< (DMAC_CHCTRLB) SERCOM2 RX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM2_TX_Val _U_(0x7)                                             /**< (DMAC_CHCTRLB) SERCOM2 TX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM3_RX_Val _U_(0x8)                                             /**< (DMAC_CHCTRLB) SERCOM3 RX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM3_TX_Val _U_(0x9)                                             /**< (DMAC_CHCTRLB) SERCOM3 TX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM4_RX_Val _U_(0xA)                                             /**< (DMAC_CHCTRLB) SERCOM4 RX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM4_TX_Val _U_(0xB)                                             /**< (DMAC_CHCTRLB) SERCOM4 TX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM5_RX_Val _U_(0xC)                                             /**< (DMAC_CHCTRLB) SERCOM5 RX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM5_TX_Val _U_(0xD)                                             /**< (DMAC_CHCTRLB) SERCOM5 TX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_CAN0_DEBUG_Val _U_(0xE)                                             /**< (DMAC_CHCTRLB) CAN0 Debug Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_CAN1_DEBUG_Val _U_(0xF)                                             /**< (DMAC_CHCTRLB) CAN1 Debug Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC0_OVF_Val   _U_(0x10)                                            /**< (DMAC_CHCTRLB) TCC0 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC0_MC0_Val   _U_(0x11)                                            /**< (DMAC_CHCTRLB) TCC0 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC0_MC1_Val   _U_(0x12)                                            /**< (DMAC_CHCTRLB) TCC0 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC0_MC2_Val   _U_(0x13)                                            /**< (DMAC_CHCTRLB) TCC0 Match/Compare 2 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC0_MC3_Val   _U_(0x14)                                            /**< (DMAC_CHCTRLB) TCC0 Match/Compare 3 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC1_OVF_Val   _U_(0x15)                                            /**< (DMAC_CHCTRLB) TCC1 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC1_MC0_Val   _U_(0x16)                                            /**< (DMAC_CHCTRLB) TCC1 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC1_MC1_Val   _U_(0x17)                                            /**< (DMAC_CHCTRLB) TCC1 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC2_OVF_Val   _U_(0x18)                                            /**< (DMAC_CHCTRLB) TCC2 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC2_MC0_Val   _U_(0x19)                                            /**< (DMAC_CHCTRLB) TCC2 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TCC2_MC1_Val   _U_(0x1A)                                            /**< (DMAC_CHCTRLB) TCC2 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC0_OVF_Val    _U_(0x1B)                                            /**< (DMAC_CHCTRLB) TC0 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC0_MC0_Val    _U_(0x1C)                                            /**< (DMAC_CHCTRLB) TC0 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC0_MC1_Val    _U_(0x1D)                                            /**< (DMAC_CHCTRLB) TC0 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC1_OVF_Val    _U_(0x1E)                                            /**< (DMAC_CHCTRLB) TC1 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC1_MC0_Val    _U_(0x1F)                                            /**< (DMAC_CHCTRLB) TC1 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC1_MC1_Val    _U_(0x20)                                            /**< (DMAC_CHCTRLB) TC1 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC2_OVF_Val    _U_(0x21)                                            /**< (DMAC_CHCTRLB) TC2 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC2_MC0_Val    _U_(0x22)                                            /**< (DMAC_CHCTRLB) TC2 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC2_MC1_Val    _U_(0x23)                                            /**< (DMAC_CHCTRLB) TC2 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC3_OVF_Val    _U_(0x24)                                            /**< (DMAC_CHCTRLB) TC3 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC3_MC0_Val    _U_(0x25)                                            /**< (DMAC_CHCTRLB) TC3 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC3_MC1_Val    _U_(0x26)                                            /**< (DMAC_CHCTRLB) TC3 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC4_OVF_Val    _U_(0x27)                                            /**< (DMAC_CHCTRLB) TC4 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC4_MC0_Val    _U_(0x28)                                            /**< (DMAC_CHCTRLB) TC4 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC4_MC1_Val    _U_(0x29)                                            /**< (DMAC_CHCTRLB) TC4 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_ADC0_RESRDY_Val _U_(0x2A)                                            /**< (DMAC_CHCTRLB) ADC0 Result Ready Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_ADC1_RESRDY_Val _U_(0x2B)                                            /**< (DMAC_CHCTRLB) ADC1 Result Ready Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_DAC_EMPTY_Val  _U_(0x2D)                                            /**< (DMAC_CHCTRLB) DAC Empty Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_PTC_EOC_Val    _U_(0x2E)                                            /**< (DMAC_CHCTRLB) PTC End of Conversion Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_PTC_WCOMP_Val  _U_(0x2F)                                            /**< (DMAC_CHCTRLB) PTC Window Compare Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_PTC_SEQ_Val    _U_(0x30)                                            /**< (DMAC_CHCTRLB) PTC Sequence Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM6_RX_Val _U_(0x31)                                            /**< (DMAC_CHCTRLB) SERCOM6 RX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM6_TX_Val _U_(0x32)                                            /**< (DMAC_CHCTRLB) SERCOM6 TX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM7_RX_Val _U_(0x33)                                            /**< (DMAC_CHCTRLB) SERCOM7 RX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_SERCOM7_TX_Val _U_(0x34)                                            /**< (DMAC_CHCTRLB) SERCOM7 TX Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC5_OVF_Val    _U_(0x35)                                            /**< (DMAC_CHCTRLB) TC5 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC5_MC0_Val    _U_(0x36)                                            /**< (DMAC_CHCTRLB) TC5 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC5_MC1_Val    _U_(0x37)                                            /**< (DMAC_CHCTRLB) TC5 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC6_OVF_Val    _U_(0x38)                                            /**< (DMAC_CHCTRLB) TC6 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC6_MC0_Val    _U_(0x39)                                            /**< (DMAC_CHCTRLB) TC6 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC6_MC1_Val    _U_(0x3A)                                            /**< (DMAC_CHCTRLB) TC6 Match/Compare 1 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC7_OVF_Val    _U_(0x3B)                                            /**< (DMAC_CHCTRLB) TC7 Overflow Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC7_MC0_Val    _U_(0x3C)                                            /**< (DMAC_CHCTRLB) TC7 Match/Compare 0 Trigger  */
#define   DMAC_CHCTRLB_TRIGSRC_TC7_MC1_Val    _U_(0x3D)                                            /**< (DMAC_CHCTRLB) TC7 Match/Compare 1 Trigger  */
#define DMAC_CHCTRLB_TRIGSRC_DISABLE          (DMAC_CHCTRLB_TRIGSRC_DISABLE_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) Only software/event triggers Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM0_RX       (DMAC_CHCTRLB_TRIGSRC_SERCOM0_RX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM0 RX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM0_TX       (DMAC_CHCTRLB_TRIGSRC_SERCOM0_TX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM0 TX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM1_RX       (DMAC_CHCTRLB_TRIGSRC_SERCOM1_RX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM1 RX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM1_TX       (DMAC_CHCTRLB_TRIGSRC_SERCOM1_TX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM1 TX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM2_RX       (DMAC_CHCTRLB_TRIGSRC_SERCOM2_RX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM2 RX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM2_TX       (DMAC_CHCTRLB_TRIGSRC_SERCOM2_TX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM2 TX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM3_RX       (DMAC_CHCTRLB_TRIGSRC_SERCOM3_RX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM3 RX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM3_TX       (DMAC_CHCTRLB_TRIGSRC_SERCOM3_TX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM3 TX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM4_RX       (DMAC_CHCTRLB_TRIGSRC_SERCOM4_RX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM4 RX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM4_TX       (DMAC_CHCTRLB_TRIGSRC_SERCOM4_TX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM4 TX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM5_RX       (DMAC_CHCTRLB_TRIGSRC_SERCOM5_RX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM5 RX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM5_TX       (DMAC_CHCTRLB_TRIGSRC_SERCOM5_TX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM5 TX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_CAN0_DEBUG       (DMAC_CHCTRLB_TRIGSRC_CAN0_DEBUG_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) CAN0 Debug Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_CAN1_DEBUG       (DMAC_CHCTRLB_TRIGSRC_CAN1_DEBUG_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) CAN1 Debug Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC0_OVF         (DMAC_CHCTRLB_TRIGSRC_TCC0_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC0 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC0_MC0         (DMAC_CHCTRLB_TRIGSRC_TCC0_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC0 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC0_MC1         (DMAC_CHCTRLB_TRIGSRC_TCC0_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC0 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC0_MC2         (DMAC_CHCTRLB_TRIGSRC_TCC0_MC2_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC0 Match/Compare 2 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC0_MC3         (DMAC_CHCTRLB_TRIGSRC_TCC0_MC3_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC0 Match/Compare 3 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC1_OVF         (DMAC_CHCTRLB_TRIGSRC_TCC1_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC1 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC1_MC0         (DMAC_CHCTRLB_TRIGSRC_TCC1_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC1 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC1_MC1         (DMAC_CHCTRLB_TRIGSRC_TCC1_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC1 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC2_OVF         (DMAC_CHCTRLB_TRIGSRC_TCC2_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC2 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC2_MC0         (DMAC_CHCTRLB_TRIGSRC_TCC2_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC2 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TCC2_MC1         (DMAC_CHCTRLB_TRIGSRC_TCC2_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TCC2 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC0_OVF          (DMAC_CHCTRLB_TRIGSRC_TC0_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC0 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC0_MC0          (DMAC_CHCTRLB_TRIGSRC_TC0_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC0 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC0_MC1          (DMAC_CHCTRLB_TRIGSRC_TC0_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC0 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC1_OVF          (DMAC_CHCTRLB_TRIGSRC_TC1_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC1 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC1_MC0          (DMAC_CHCTRLB_TRIGSRC_TC1_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC1 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC1_MC1          (DMAC_CHCTRLB_TRIGSRC_TC1_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC1 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC2_OVF          (DMAC_CHCTRLB_TRIGSRC_TC2_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC2 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC2_MC0          (DMAC_CHCTRLB_TRIGSRC_TC2_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC2 Match/Compare 0 Trigger Position  */
