Microchip-MPLAB-Harmony/csp_apps_pic32cm_jh00_jh01/apps/port/port_led_on_off_polling/firmware/src/packs/PIC32CM5164JH00100_DFP/component/dmac.h
#define DMAC_CHCTRLB_TRIGSRC_TC2_MC1          (DMAC_CHCTRLB_TRIGSRC_TC2_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC2 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC3_OVF          (DMAC_CHCTRLB_TRIGSRC_TC3_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC3 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC3_MC0          (DMAC_CHCTRLB_TRIGSRC_TC3_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC3 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC3_MC1          (DMAC_CHCTRLB_TRIGSRC_TC3_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC3 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC4_OVF          (DMAC_CHCTRLB_TRIGSRC_TC4_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC4 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC4_MC0          (DMAC_CHCTRLB_TRIGSRC_TC4_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC4 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC4_MC1          (DMAC_CHCTRLB_TRIGSRC_TC4_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC4 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_ADC0_RESRDY      (DMAC_CHCTRLB_TRIGSRC_ADC0_RESRDY_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) ADC0 Result Ready Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_ADC1_RESRDY      (DMAC_CHCTRLB_TRIGSRC_ADC1_RESRDY_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) ADC1 Result Ready Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_DAC_EMPTY        (DMAC_CHCTRLB_TRIGSRC_DAC_EMPTY_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) DAC Empty Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_PTC_EOC          (DMAC_CHCTRLB_TRIGSRC_PTC_EOC_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) PTC End of Conversion Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_PTC_WCOMP        (DMAC_CHCTRLB_TRIGSRC_PTC_WCOMP_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) PTC Window Compare Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_PTC_SEQ          (DMAC_CHCTRLB_TRIGSRC_PTC_SEQ_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) PTC Sequence Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM6_RX       (DMAC_CHCTRLB_TRIGSRC_SERCOM6_RX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM6 RX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM6_TX       (DMAC_CHCTRLB_TRIGSRC_SERCOM6_TX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM6 TX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM7_RX       (DMAC_CHCTRLB_TRIGSRC_SERCOM7_RX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM7 RX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_SERCOM7_TX       (DMAC_CHCTRLB_TRIGSRC_SERCOM7_TX_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) SERCOM7 TX Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC5_OVF          (DMAC_CHCTRLB_TRIGSRC_TC5_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC5 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC5_MC0          (DMAC_CHCTRLB_TRIGSRC_TC5_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC5 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC5_MC1          (DMAC_CHCTRLB_TRIGSRC_TC5_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC5 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC6_OVF          (DMAC_CHCTRLB_TRIGSRC_TC6_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC6 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC6_MC0          (DMAC_CHCTRLB_TRIGSRC_TC6_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC6 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC6_MC1          (DMAC_CHCTRLB_TRIGSRC_TC6_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC6 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC7_OVF          (DMAC_CHCTRLB_TRIGSRC_TC7_OVF_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC7 Overflow Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC7_MC0          (DMAC_CHCTRLB_TRIGSRC_TC7_MC0_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC7 Match/Compare 0 Trigger Position  */
#define DMAC_CHCTRLB_TRIGSRC_TC7_MC1          (DMAC_CHCTRLB_TRIGSRC_TC7_MC1_Val << DMAC_CHCTRLB_TRIGSRC_Pos) /**< (DMAC_CHCTRLB) TC7 Match/Compare 1 Trigger Position  */
#define DMAC_CHCTRLB_TRIGACT_Pos              _U_(22)                                              /**< (DMAC_CHCTRLB) Trigger Action Position */
#define DMAC_CHCTRLB_TRIGACT_Msk              (_U_(0x3) << DMAC_CHCTRLB_TRIGACT_Pos)               /**< (DMAC_CHCTRLB) Trigger Action Mask */
#define DMAC_CHCTRLB_TRIGACT(value)           (DMAC_CHCTRLB_TRIGACT_Msk & ((value) << DMAC_CHCTRLB_TRIGACT_Pos))
#define   DMAC_CHCTRLB_TRIGACT_BLOCK_Val      _U_(0x0)                                             /**< (DMAC_CHCTRLB) One trigger required for each block transfer  */
#define   DMAC_CHCTRLB_TRIGACT_BEAT_Val       _U_(0x2)                                             /**< (DMAC_CHCTRLB) One trigger required for each beat transfer  */
#define   DMAC_CHCTRLB_TRIGACT_TRANSACTION_Val _U_(0x3)                                             /**< (DMAC_CHCTRLB) One trigger required for each transaction  */
#define DMAC_CHCTRLB_TRIGACT_BLOCK            (DMAC_CHCTRLB_TRIGACT_BLOCK_Val << DMAC_CHCTRLB_TRIGACT_Pos) /**< (DMAC_CHCTRLB) One trigger required for each block transfer Position  */
#define DMAC_CHCTRLB_TRIGACT_BEAT             (DMAC_CHCTRLB_TRIGACT_BEAT_Val << DMAC_CHCTRLB_TRIGACT_Pos) /**< (DMAC_CHCTRLB) One trigger required for each beat transfer Position  */
#define DMAC_CHCTRLB_TRIGACT_TRANSACTION      (DMAC_CHCTRLB_TRIGACT_TRANSACTION_Val << DMAC_CHCTRLB_TRIGACT_Pos) /**< (DMAC_CHCTRLB) One trigger required for each transaction Position  */
#define DMAC_CHCTRLB_CMD_Pos                  _U_(24)                                              /**< (DMAC_CHCTRLB) Software Command Position */
#define DMAC_CHCTRLB_CMD_Msk                  (_U_(0x3) << DMAC_CHCTRLB_CMD_Pos)                   /**< (DMAC_CHCTRLB) Software Command Mask */
#define DMAC_CHCTRLB_CMD(value)               (DMAC_CHCTRLB_CMD_Msk & ((value) << DMAC_CHCTRLB_CMD_Pos))
#define   DMAC_CHCTRLB_CMD_NOACT_Val          _U_(0x0)                                             /**< (DMAC_CHCTRLB) No action  */
#define   DMAC_CHCTRLB_CMD_SUSPEND_Val        _U_(0x1)                                             /**< (DMAC_CHCTRLB) Channel suspend operation  */
#define   DMAC_CHCTRLB_CMD_RESUME_Val         _U_(0x2)                                             /**< (DMAC_CHCTRLB) Channel resume operation  */
#define DMAC_CHCTRLB_CMD_NOACT                (DMAC_CHCTRLB_CMD_NOACT_Val << DMAC_CHCTRLB_CMD_Pos) /**< (DMAC_CHCTRLB) No action Position  */
#define DMAC_CHCTRLB_CMD_SUSPEND              (DMAC_CHCTRLB_CMD_SUSPEND_Val << DMAC_CHCTRLB_CMD_Pos) /**< (DMAC_CHCTRLB) Channel suspend operation Position  */
#define DMAC_CHCTRLB_CMD_RESUME               (DMAC_CHCTRLB_CMD_RESUME_Val << DMAC_CHCTRLB_CMD_Pos) /**< (DMAC_CHCTRLB) Channel resume operation Position  */
#define DMAC_CHCTRLB_Msk                      _U_(0x03C03F7F)                                      /**< (DMAC_CHCTRLB) Register Mask  */


/* -------- DMAC_CHINTENCLR : (DMAC Offset: 0x4C) (R/W 8) Channel Interrupt Enable Clear -------- */
#define DMAC_CHINTENCLR_RESETVALUE            _U_(0x00)                                            /**<  (DMAC_CHINTENCLR) Channel Interrupt Enable Clear  Reset Value */

#define DMAC_CHINTENCLR_TERR_Pos              _U_(0)                                               /**< (DMAC_CHINTENCLR) Channel Transfer Error Interrupt Enable Position */
#define DMAC_CHINTENCLR_TERR_Msk              (_U_(0x1) << DMAC_CHINTENCLR_TERR_Pos)               /**< (DMAC_CHINTENCLR) Channel Transfer Error Interrupt Enable Mask */
#define DMAC_CHINTENCLR_TERR(value)           (DMAC_CHINTENCLR_TERR_Msk & ((value) << DMAC_CHINTENCLR_TERR_Pos))
#define DMAC_CHINTENCLR_TCMPL_Pos             _U_(1)                                               /**< (DMAC_CHINTENCLR) Channel Transfer Complete Interrupt Enable Position */
#define DMAC_CHINTENCLR_TCMPL_Msk             (_U_(0x1) << DMAC_CHINTENCLR_TCMPL_Pos)              /**< (DMAC_CHINTENCLR) Channel Transfer Complete Interrupt Enable Mask */
#define DMAC_CHINTENCLR_TCMPL(value)          (DMAC_CHINTENCLR_TCMPL_Msk & ((value) << DMAC_CHINTENCLR_TCMPL_Pos))
#define DMAC_CHINTENCLR_SUSP_Pos              _U_(2)                                               /**< (DMAC_CHINTENCLR) Channel Suspend Interrupt Enable Position */
#define DMAC_CHINTENCLR_SUSP_Msk              (_U_(0x1) << DMAC_CHINTENCLR_SUSP_Pos)               /**< (DMAC_CHINTENCLR) Channel Suspend Interrupt Enable Mask */
#define DMAC_CHINTENCLR_SUSP(value)           (DMAC_CHINTENCLR_SUSP_Msk & ((value) << DMAC_CHINTENCLR_SUSP_Pos))
#define DMAC_CHINTENCLR_Msk                   _U_(0x07)                                            /**< (DMAC_CHINTENCLR) Register Mask  */


/* -------- DMAC_CHINTENSET : (DMAC Offset: 0x4D) (R/W 8) Channel Interrupt Enable Set -------- */
#define DMAC_CHINTENSET_RESETVALUE            _U_(0x00)                                            /**<  (DMAC_CHINTENSET) Channel Interrupt Enable Set  Reset Value */

#define DMAC_CHINTENSET_TERR_Pos              _U_(0)                                               /**< (DMAC_CHINTENSET) Channel Transfer Error Interrupt Enable Position */
#define DMAC_CHINTENSET_TERR_Msk              (_U_(0x1) << DMAC_CHINTENSET_TERR_Pos)               /**< (DMAC_CHINTENSET) Channel Transfer Error Interrupt Enable Mask */
#define DMAC_CHINTENSET_TERR(value)           (DMAC_CHINTENSET_TERR_Msk & ((value) << DMAC_CHINTENSET_TERR_Pos))
#define DMAC_CHINTENSET_TCMPL_Pos             _U_(1)                                               /**< (DMAC_CHINTENSET) Channel Transfer Complete Interrupt Enable Position */
#define DMAC_CHINTENSET_TCMPL_Msk             (_U_(0x1) << DMAC_CHINTENSET_TCMPL_Pos)              /**< (DMAC_CHINTENSET) Channel Transfer Complete Interrupt Enable Mask */
#define DMAC_CHINTENSET_TCMPL(value)          (DMAC_CHINTENSET_TCMPL_Msk & ((value) << DMAC_CHINTENSET_TCMPL_Pos))
#define DMAC_CHINTENSET_SUSP_Pos              _U_(2)                                               /**< (DMAC_CHINTENSET) Channel Suspend Interrupt Enable Position */
#define DMAC_CHINTENSET_SUSP_Msk              (_U_(0x1) << DMAC_CHINTENSET_SUSP_Pos)               /**< (DMAC_CHINTENSET) Channel Suspend Interrupt Enable Mask */
#define DMAC_CHINTENSET_SUSP(value)           (DMAC_CHINTENSET_SUSP_Msk & ((value) << DMAC_CHINTENSET_SUSP_Pos))
#define DMAC_CHINTENSET_Msk                   _U_(0x07)                                            /**< (DMAC_CHINTENSET) Register Mask  */


